{
  "architectures": [
    "SwinForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "depths": [
    2,
    2,
    6,
    2
  ],
  "drop_path_rate": 0.1,
  "dtype": "float32",
  "embed_dim": 96,
  "encoder_stride": 32,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "annual crop land",
    "1": "forest",
    "2": "brushland or shrubland",
    "3": "highway or road",
    "4": "industrial buildings or commercial buildings",
    "5": "pasture land",
    "6": "permanent crop land",
    "7": "residential buildings or homes or apartments",
    "8": "river",
    "9": "lake or sea"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "label2id": {
    "annual crop land": "0",
    "brushland or shrubland": "2",
    "forest": "1",
    "highway or road": "3",
    "industrial buildings or commercial buildings": "4",
    "lake or sea": "9",
    "pasture land": "5",
    "permanent crop land": "6",
    "residential buildings or homes or apartments": "7",
    "river": "8"
  },
  "layer_norm_eps": 1e-05,
  "mlp_ratio": 4.0,
  "model_type": "swin",
  "num_channels": 3,
  "num_heads": [
    3,
    6,
    12,
    24
  ],
  "num_layers": 4,
  "out_features": [
    "stage4"
  ],
  "out_indices": [
    4
  ],
  "patch_size": 4,
  "path_norm": true,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "stage_names": [
    "stem",
    "stage1",
    "stage2",
    "stage3",
    "stage4"
  ],
  "transformers_version": "5.12.1",
  "use_absolute_embeddings": false,
  "use_cache": false,
  "window_size": 7
}
